\documentclass[11pt,a4paper]{article}

%%%%%%%%%%
% IMPORT %
%%%%%%%%%%
\usepackage[utf8x]{inputenc}
\usepackage{ucs}
\usepackage[french]{babel}
\usepackage[T1]{fontenc}
\usepackage{amsmath}
\usepackage{amsfonts}
\usepackage{amssymb}
\usepackage{graphicx}
\usepackage{listings}
%\usepackage[left=2cm,right=2cm,top=2cm,bottom=2cm]{geometry}

%%%%%%%%%%%%%
% MAIN PAGE %
%%%%%%%%%%%%%
\title{Concepts liés au cours de SdC}
\author{PICARD DRUET David}
\date{\today}


\begin{document}
\maketitle
Par ce que je suis un noob et je le vis mal.\\
Et puis le fait que ça puisse mener à tirer dans des cochons avec un pistolet à clou est très motivant.\\
La grande majorité (si ce n'est la totalité) des informations sont retrouvables avec n'importe quel moteur de recherche.\\
Le seul intérêt de ce doc en fait, c'est de les rassembler.\\

\section{URI}
Courte chaîne de caractères identifiant une ressource sur un réseau.
Doit permettre d'identifier une ressource de manière permanente, même si la ressource est déplacée ou supprimée.
ex: Dans le monde réel, y'a l'ISBN pour les livres. Ben c'est pareil, mais sur le web.
Les adresses IRI incluent les adresses URI et les adresses URL.

\section{Web sémantique}
A FAIRE

\section{RDF : Resource Description Framework}
C'est un modèle de graph destiné à la description (de façon formelle) des ressources Web et leurs métadonnées (= données liées).
Une des syntaxe de RDF est le RDF/XML.

\subsection{Principes fondamentaux}
Document RDF = ensemble de triplets\\
triplet RDF = (sujet, prédicat, objet)\\
Avec: sujet -> ressource à décrire; prédicat -> propriété applicable à la ressource; objet -> valeur de la propriété.\\
Le prédicat est **obligatoirement** identifié par une URI.\\
ex:\\
Un document RDF ainsi formé correspond à un multigraphe orienté étiqueté. Chaque triplet correspond alors à un arc orienté dont le label est le prédicat, le nœud source est le sujet et le nœud cible est l'objet.

La structure de RDF est extrêmement générique et sert de base à un certain nombre de schémas ou vocabulaires dédiés à des applications spécifiques comme les langages d'ontologie RDFS et OWL.

\subsection{Languages de requête}
Il y'en a un certain nombre. Le language SPARQL est à la fois celui évoqué dans le cours, et destiné à devenir le standard dans ce domaine.\\
ex:
\begin{lstlisting}
PREFIX foaf:   <http://xmlns.com/foaf/0.1/>

SELECT ?name ?mbox
WHERE
  { ?x foaf:name ?name.
    ?x foaf:mbox ?mbox }
\end{lstlisting}

\section{SPARQL: SPARQL Protocol and RDF Query Language}
\subsection{Caractéristiques}
Technologie clé du web sémantique, adapté à la structure spécifique des graphes RDF. Assez proche de SQL, permet d'exprimer des requêtes interrogatives (SELECT) ou constructives (CONSTRUCT).
\begin{itemize}
    \item Requête SELECT: extrait du graphe RDF un sous-graphe vérifiant les conditions définies dans une clause WHERE.
    \item Requête CONSTRUCT: engendre un nouveau graphe, que complète le graphe interrogé.
    \item Valeurs optionnelles: OPTIONAL
\end{itemize}

\subsection{Exemples}
Les exemples 1 et 2 vont porter sur un graphe RDF fait en TP, exemple\_graph\_rdf.txt, normalement fourni avec le document.


\paragraph{Ex 1}
On veut obtenir toutes les reactions qui consomment du glucose
\begin{lstlisting}
### On prend chaque reaction du graphe, sans redondance
SELECT DISTINCT ?reaction
WHERE{
    :glucose :estConsommePar ?reaction.
}
\end{lstlisting}


\paragraph{Ex 2}
On veut obtenir toutes les reactions qui produisent du E.
\begin{lstlisting}
SELECT DISTINCT ?reaction
WHERE{
    ?reaction :produit :E.
}
\end{lstlisting}

\paragraph{Ex 3}
Cet exemple porte sur ce graphe:
\begin{lstlisting}
@prefix foaf:  <http://xmlns.com/foaf/0.1/> .
_:a  foaf:name   "Johnny Lee Outlaw" .
_:a  foaf:mbox   <mailto:jlow@example.com> .
_:b  foaf:name   "Peter Goodguy" .
_:b  foaf:mbox   <mailto:peter@example.org> .
_:c  foaf:mbox   <mailto:carol@example.org> .
\end{lstlisting}
\vspace{10pt}
\textbf{Requête:}
\begin{lstlisting}
PREFIX foaf:   <http://xmlns.com/foaf/0.1/>

### On prend tout name et mbox dans le graph
SELECT ?name ?mbox
### Ou name et mbox sont associes au meme sujet
WHERE
  { ?x foaf:name ?name .
    ?x foaf:mbox ?mbox }
\end{lstlisting}


\vspace{5pt}
\textbf{Résultats}
\begin{tabular}{c | l}
name & mbox \\
\hline
"Johnny Lee Outlaw" & <mailto:jlow@example.com>\\
"Peter Goodguy" & <mailto:peter@example.org>\\
\end{tabular}

\paragraph*{Ex 4}
A partir d'ici, ce seront des exemples de requêtes sur CHEBI, une base de données sur les petites molécules.
\begin{lstlisting}
### IRI
PREFIX chebi: <http://purl.obolibrary.org/obo/CHEBI_>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX owl: <http://www.w3.org/2002/07/owl#>

### Pour obtenir tout les descendants du glucose (id chebi: 17234)
### On recupere les descendants, avec label si il existe.
SELECT DISTINCT ?desc (str(?descLabel) as ?label)
WHERE{
###Qui sont sous classe du glucose
    ?desc rdfs:subClassOf+ chebi:17234.
### si il existe un label du descendant, il est retourne
    OPTIONAL {?desc rdfs:label ?descLabel.}
}
    
    
### Pour obtenir tout les ancetres du glucose:
SELECT DISTINCT ?anc (str(?ancLabel) as ?label)
WHERE {
    chebi:17234 rdfs:subClassOf+ ?anc .
    ?anc rdf:type owl:Class .
    OPTIONAL { ?anc rdfs:label ?ancLabel .  }
}


### Ancetres communs du glucose et myricoside
SELECT DISTINCT ?anc (str(?ancLabel) as ?label)
WHERE {
   chebi:17234 rdfs:subClassOf+ ?anc .
   chebi:7055 rdfs:subClassOf+ ?anc .
   ?anc rdf:type owl:Class .
   OPTIONAL { ?anc rdfs:label ?ancLabel .  }

}

\end{lstlisting}

\paragraph*{Ex 1}
\begin{lstlisting}
\end{lstlisting}
\end{document}






